20240212T234008--kdoc-91-『世界一流エンジニアの思考法』__book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-03T18:41:44Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 91: 『世界一流エンジニアの思考法』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 91: 『世界一流エンジニアの思考法』</h1>
<div id="outline-container-orgba07a65" class="outline-2">
<h2 id="orgba07a65"><a href="#orgba07a65">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgba07a65">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-16 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-18 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf2bd22f" class="outline-2">
<h2 id="orgf2bd22f"><a href="#orgf2bd22f">概要</a></h2>
<div class="outline-text-2" id="text-orgf2bd22f">
<p>
『<a href="https://amzn.to/3SE79Xi">世界一流エンジニアの思考法</a>』を読んだ。Microsoftで働く作者が一流の同僚の習慣を紹介したり、素晴らしい労働体験と日本的労働を比較する本。
</p>
</div>
</div>
<div id="outline-container-orgd4df456" class="outline-2">
<h2 id="orgd4df456"><a href="#orgd4df456">メモ</a></h2>
<div class="outline-text-2" id="text-orgd4df456">
<p>
いきなり手を動かさない。まずは事実(データ)を1つ見つける → いくつかの仮説を立てる → その仮説を証明するための行動をとる。
</p>

<p>
単に思いつきでいろいろなパターンを試して正解を探しているだけだと、とても時間がかかるうえ、新しい知識を何も学んでいない。思いつきによる試行錯誤は悪。
</p>

<p>
どんなに頭がいい人でも理解には時間がかかる。頭のいい人の理解が早いように見えるのは、時間をかけて基礎を積み重ねているので、すでに理解していることに関して脳のメモリにコンテキストが載っているからである。早くできるように頑張ることは最終的な生産性をむしろ下げる。理解せずにコピペしたりするから。
</p>

<p>
理解の3要素。
</p>

<ul class="org-ul">
<li><p>
その構造をつかんで、人に説明できること
</p>

<p>
本質をつかんでいると、シンプルにも詳しくも人にわかりやすく説明ができる。
</p></li>

<li><p>
いつでもどこでも即座に取り出して使えること
</p>

<p>
基本的な構造から把握した知識は、参考書を見たりググったりせずともいつどこでも即座に使えて応用範囲が広い。
</p></li>

<li><p>
知見をふまえて応用がきくこと
</p>

<p>
似た課題における問題解決はもちろん、複雑な難題も因数分解して組み合わせられる。新しいものも生み出せる。
</p></li>
</ul>

<p>
「ここはだいたいこんな雰囲気だよね」と読み飛ばせそうなところでも、丁寧に時間をかけ、サンプルの数値を書き、十分な理解に努めていた。
</p>

<p>
コードを読むのを早くすることばかり考えていたが、彼はコードのロジックを読むのではなくコードの意図とその背後のアーキテクチャを理解するために読み込んでいた。理解にしっかり時間をかけるのを恐れない。
</p>

<p>
プログラミングを基礎からやり直すためにした3つの作戦。
</p>

<ul class="org-ul">
<li><p>
定時後や週末に、プログラミングの基礎を学ぶ
</p>

<p>
チュートリアルから。ギターの基礎練習のつもりで1つ1つ丁寧に読んでコードを書く。
</p></li>

<li><a href="20240213004323-c.html#ID-ccab3205-73b6-4009-9ec8-4e08eb1d2003">C#</a>の言語仕様を勉強する</li>
<li><p>
LeetCodeを一番簡単なレベルから毎日やる
</p>

<p>
1問に時間をかけて別のやり方を試した。メモリや速度の違いを見たりした。英文は読み飛ばし癖がついていたが、時間をかけてゆっくり理解して読むようにした。
</p></li>
</ul>

<p>
「理解は時間がかかるもの」として、急がず、徹底的に理解する習慣をつけた。以前はメモをとりまくっていたコードリーディングもゆっくり理解して100%挙動が理解できている。
</p>

<p>
お客さんの言っていることは聞くけど、信用せずファクトを検証していくのがよい。プログラミングも同じ。自分でログなどを検証して問題解決をしないと思い込みをしてしまう。
</p>

<p>
デザインドキュメントをコードの前に書く。
</p>

<p>
自分やドメインエキスパートに対して質問するのを恐れない。エンジニアがより賢くなるのはチームの幸せにつながる。
</p>

<p>
一番大変なのは頭の中にメンタルモデルをつくる行為。一度作れば素早くソフトウェアの動作をイメージできる。自分なりの脳内イメージを作り上げられれば、頭の中で考えを整理したり、問題発見に至るプロセスが大幅に高速化する。
</p>

<p>
1つのことで2時間以上ブロックされたら、質問するなり相談して寝かせておいて、他の仕事をやっておくほうがよい。
</p>

<p>
Be Lazyを達成するための習慣。
</p>

<ul class="org-ul">
<li>望んでいる結果を達成するために、最低限の努力をする</li>
<li>不必要なものや付加価値のない仕事(過剰準備含む)をなくす</li>
<li>簡潔さを目指す</li>
<li>優先順位をつける</li>
<li>時間や費やした時間より、アウトプットと生産性に重点をおく</li>
<li>長時間会議しないように奨励する</li>
<li>会議は会議の時間内で効率的かつ生産的に価値を提供する</li>
</ul>

<p>
いかにやることを減らすかに頭を使っている。減らすこと自体に価値がある。プロジェクトにかかわる人全員で、本当に必要な機能は何か、不要な機能は何かを見極め、プロセスの改善をしていかに「楽」をしてより高い価値を生み出せるかをディスカッションする必要がある。
</p>

<p>
見極める手順。
</p>

<ol class="org-ol">
<li><p>
重要な1つだけピックアップする
</p>

<p>
10個のうち1~3個しかやらないことは決して悪でない。そのほうが「バリュー」として効果的である。
</p></li>

<li><p>
時間を固定して、できることを最大化する
</p>

<p>
何でも「すべき」というマインドだと、どうしても時間をだらだらと延長しがち。時間は固定して、その中で価値を最大化するとよい。たくさん課題があっても時間の中で最大限バリューが出るように「今日はこの2つだけやろう」。時間が最大の制約なので、時間内に確実にできる数に絞って、最大の成果を出せるのに集中する。
</p></li>

<li><p>
準備・持ち帰りをやめてその場で解決する
</p>

<p>
会議の場だけで簡潔する。ざっくりしたアジェンダはあるが準備に時間をかけて会議に臨まない。必要な意思決定は極力その場で行う。会議に出たら「会議の時間内だけで完結」するように訓練すると生産的。
</p></li>

<li><p>
物理的にやることを減らす
</p>

<p>
マネージャが簡単にスコープから外す。みんなが絶対的に重要なタスクにフォーカスできるように気を配っている。物理的にできないものは頑張ってもできない。自分の仕事の中で「何をやらないか」を決めていく。計画が正しいとは限らない。仕事はどれだけやったかではなく、どれだけ会社にインパクトを与える仕事ができたかのほうが重要。
</p></li>
</ol>

<p>
リスクや間違いを快く受け入れる。日本と欧米で大きく異なる部分。
</p>

<p>
本番環境をお客さんとハックして改善する「ハックフェスト」。お客さんのもっとも難しい問題を解いてこいと言われる。世の中にどこにも情報が落ちてないような問題解決に取り組むことが評価される。
</p>

<p>
失敗を受け入れる実践法。
</p>

<ol class="org-ol">
<li>フィードバックを歓迎するムードをつくる</li>
<li>検討をやめて検証する。大量の資料を要求したり書類の精度を期待するより、時間をかけずさっさと検証の段階に進み、フィードバックを得る。機能を検討する暇があったら、実際に実装してベータテストで顧客に試してさっとデータを取る。検討よりも検証を、という考え方はソフトウェア開発にとどまらずあらゆる分野に応用可能である</li>
<li>早く失敗できるように考える。開発の現場ではフィードバックが遅いのは致命的になる</li>
</ol>

<p>
不確実性を受け入れる。精密な結果の予測を要求しない、変更に柔軟、変化していく。計画どおりにいかないことは失敗ではないし、計画通りでなければならない必要もない。スピーディに軌道修正をかけていける柔軟性のほうが重要。第一歩として「納期は絶対」の神話は捨てる。日本人は納期に厳格すぎて無理をする傾向にあるが、それに見合った価値はない。
</p>

<p>
Q(品質)、C(コスト)、D(納期)、S(スコープ)はトレードオフの関係にある。進捗の「実績」だけで状況判断し、「納期」を固定したまま「スコープ」を出し入れする。納期通りにすべての予定された機能をリリースしているソフトウェアジャイアントはいない。リリース予定日が近づくとしれっと特定の機能が削除されていることは多い。アメリカでは納期が近くなっても無理して機能を完成させず、品質の良いものを作るようにしよう、となる。プログラマの生活や健康を犠牲にしてまで取り組むことは中長期的に疲弊して生産性が低下するため、マネジメント的に効率が悪い。
</p>

<p>
無理はしないほうがよい。チームの適正な生産量を超えた量を一定期間で達成した結果、組織の問題を覆い隠すことにつながる。「今回できたのだから、次回もこれぐらいできるよね」と、無理が積み重なる悪循環に陥る。チームのリソースを超えているときは現実を見て「物量を減らし、より大きな価値を生み出す工夫」が必要。いかにやらないことを見つけるかが重要。
</p>

<p>
先に実装しておき一部のユーザに使ってもらって、実際に動き価値もあると判断してからスイッチして本当の公開をする、ということもできる。
</p>

<p>
不確実性を受け入れるためにできること。
</p>

<ol class="org-ol">
<li>楽に達成できる計画で仕事をする。プラス何日か余裕のあるスケジュールを設定する。日本ではなるはやで、とか依頼されることが多い。海外ではそういった火急の依頼はマネジメント能力の欠如とみなされる。価値は状況によって変わる。物量をこなすのが生産性が高いわけではない。生み出すものの価値にフォーカスする</li>
<li>無理・断る練習をする。鏡の法則というのがある。自分に適用しているルールを無意識に他人に適用してしまう。納期厳守で仕事をしていると他人にもそれを求める傾向がある。無理を承知でのお願いの連鎖はみんなの疲弊を生み、チームや組織の業務改善につながらない。個人として無理をしてプロジェクトの帳尻を合わせてしまうことが実は問題点を先送りにし、チームとしてのパフォーマンスを下げる可能性がある</li>
<li>他の文化の視点を学んで見る</li>
</ol>

<p>
計画の変更は悪ではない。現実を見て、フィードバックを受けて納期や仕様が変わっていくのはむしろ「善」である。
</p>

<p>
日本では一度決めた納期を守り通し必死にやる。目標が達成できなかったときは失敗とされる。一度目標が定められると予測が誤っていても必ずやりきらないといけない対象になる。インターナショナルチームでは目標達成に無理があると判明した場合はもっとも優先順位の高い最初の1ステップのみを目指すように方向転換する。定時以降の仕事や休日出勤でカバーする流れにならない。できないものはできないと判断する。KPIは無理なく楽に達成できる程度のものであるべきという大前提がある。
</p>

<p>
定時でできる量になるよう作業量を今の実力でできる範囲内に調整する。目標はあくまで目標で、実際どうだったか、改善ポイントやベストプラクティスを尋ねられる。
</p>

<p>
より少ない時間で価値を最大化できている集団ほど、会社内ですべきことが少ない。日本ではKPIのような評価基準に加えて、社会人や社員として「こうあるべき」が非常に多い。反省や改善点が非常に多く、過大な要求が現場を追い詰め無限の労働へと駆り立てている。そんな期待に応えようとするのは無理。
</p>

<p>
コードリーディングのコツは極力読まないこと。実装は極力見ないようにして、インターフェイスと構造を理解する。
</p>

<p>
自分にとって難しすぎると感じる2つのケース。
</p>

<ol class="org-ol">
<li>自分の基礎的な学力が足りてない。積み上げるしかない</li>
<li>自分が無理なやり方をしているケース。努力や才能が足りないからこんなに大変と思い込んでいる。自分にとって難しすぎると感じるときはたいてい脳の使い方が間違っている。才能の差ではなく脳に余裕のない状態で酷使している可能性が高い</li>
</ol>

<p>
仕事の難易度レベル。
</p>

<ol class="org-ol">
<li>何もググらずに即座に実装できる</li>
<li>問題をどう解決するかは思い浮かぶが、具体的な方法は忘れているのでググる必要がある</li>
<li>自分は解法を知らないが、スパイクソリューションをしたらできそうなもの</li>
<li>自分だけでは解決が難しい、ものすごく時間がかかるもの</li>
</ol>

<p>
生産性とは、1を増やすことではないか。コードリーディングが遅い根本的な原因は、コードを見たときにどういう挙動をするか明確にイメージできないか、もしくは構造の把握が下手だから。レベル1のものが増えると脳の負担は激減する。重要なことは、自分がしんどいと感じる「努力」は一切やめてしまうこと。
</p>

<p>
自分が楽に取り組める難易度の低いもので練習すべき。レベル1の課題はもっともコントロール感がある。自分が何も見ずにさくさくコーディングできるものを増やしていく。
</p>

<p>
「アウトカム」至上主義が上達を阻害する。AIに書いてもらったりコピペすれば見かけのアウトカムは上がるが、中身を理解していないからコントロールできてる感はない。都度調べることになり応用が効かない。作業ばかりが続くので自分が知らないことや新しいことのキャッチアップなどもできない。成長しない。技術を徹底的に理解し、理解した情報の整理をして、すぐに取り出せるレベル1の情報にしてこそ、長い目で見たさいの生産性は上がる。
</p>

<p>
優先順位の高い仕事に対して、それだけに集中する時間を意識的に作り出す必要がある。毎日4時間をブロックして、Teamsやメールを一切閉じて、自分の作業だけをやる。
</p>

<p>
メンタルモデルを脳内に作成するためには、単にやって終わりではなく、細かいところまで自分で「ハンドル」できるレベルまで理解して整理する必要がある。
</p>

<p>
人間が記憶するために有効な方法は、シンプルに思い出そうとする頑張ること。ノートを取りながら学ぶのではなく、自分が学んだことを後から思い出しながら要点を書くのがポイント。
</p>

<p>
頭の中のみで整理する。みんな高等で済ませようとする。準備やレジュメもないままどんどん進んでそこで決定する。
</p>

<p>
後で人に説明することを意識するだけでも、相当集中力や記憶力が向上する。話を聞きナきながらビジュアルのイメージを作ったりメンタルモデルを脳の中で視覚化したりして自分の理解を確認する。
</p>

<p>
日本でのコミュニケーションはすべての情報を整理して送ってあげると喜ばれたが、アメリカではたくさん情報があっても盛りだくさんすぎてわかりにくいと受け止められる。最初から全部説明せず、「情報量を減らす」コミュニケーションの仕方が重要であった。リアルタイムに理解できる適切な情報量が好まれる。
</p>

<p>
日本人は持ち帰って考える癖がある。
</p>

<p>
自分にその分野のメンタルモデルやコンテキストがなければ、すぐさまエキスパートに聞いたほうがよい。相手が忙しいかどうかは考える必要がない。
</p>

<p>
ディスカッションはどちらが正しいかはどうでもいい。自分の考えを自分なりに深めるための行為なので、初心者こそやったほうがいい。間違えたら恥ずかしいという感覚は一切捨てる。
</p>

<ul class="org-ul">
<li>「生産性を上げるためには学習。仕事を定時くらいで切り上げて、その後で自分のやりたいトピックを勉強したり試したりする」仕事ばかりしていては短期的なアウトプットは上がったように見えても根本的な生産性が上がらない</li>
<li>長時間労働はサステナブルではない</li>
</ul>

<p>
時短を試みても切りのいいところまでやろうと考えて、結局寝る直前までかかることが頻繁にあった。タイムボックス制をした。例えば17時になったら仕事が途中でもどんなに切りが悪くてもすぐに仕事をやめる。いつのまにか時間が過ぎてしまわぬよう、5時きっかりにアラームをセットして。
</p>
</div>
</div>
<div id="outline-container-org0e06a26" class="outline-2">
<h2 id="org0e06a26"><a href="#org0e06a26">関連</a></h2>
<div class="outline-text-2" id="text-org0e06a26">
<ul class="org-ul">
<li><a href="20240207T092747--kdoc-77-検証する方法があると理解が進む__essay.html#ID-20240207T092747">KDOC 77: 検証する方法があると理解が進む</a>。検証してミクロな単位で検証できると勉強にもなるし、問題解決に役立つ</li>
<li><a href="20221210T014600--kdoc-10-より理解するための基準を考える__essay.html#ID-20221210T014600">KDOC 10: より理解するための基準を考える</a>。理解について書いている。理解をいかにするかは、この本のテーマの1つである</li>
<li><a href="20221102T234233--kdoc-4-テッキーな人たちを観察する__essay.html#ID-20221102T234233">KDOC 4: テッキーな人たちを観察する</a>。例に出てくる人々は、まさに彼らがやっていることに見えた</li>
</ul>
</div>
</div>
<div id="outline-container-org58ef8e3" class="outline-2">
<h2 id="org58ef8e3"><a href="#org58ef8e3">Backlinks</a></h2>
<div class="outline-text-2" id="text-org58ef8e3">
<ul class="org-ul">
<li><a href="./20240224T021232--kdoc-102-応答不可な時間帯を作って集中する__essay.html">KDOC 102: 応答不可な時間帯を作って集中する</a></li>
<li><a href="./20240224T030106--kdoc-104-やりたいことが多すぎる__essay.html">KDOC 104: やりたいことが多すぎる</a></li>
<li><a href="./20240228T003028--kdoc-112-何を捨てるかが重要だと考えた__essay.html">KDOC 112: 何を捨てるかが重要だと考えた</a></li>
<li><a href="./20240327T234430--kdoc-132-『技術書の読書術』__book.html">KDOC 132: 『技術書の読書術』</a></li>
<li><a href="./20240427T010358--kdoc-139-『googleのソフトウェアエンジニアリング』__book.html">KDOC 139: 『Googleのソフトウェアエンジニアリング』</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
